YEARS_NULL_DICT = {2015: 0, 2016: 0, 2017: 0, 2018: 0, 2019: 0, 2020: 0, 2021: 0, 2022: 0}
CURRENCY_TO_RUB = {"AZN": 35.68, "BYR": 23.91, "EUR": 59.90, "GEL": 21.74, "KGS": 0.76, "KZT": 0.13, "RUR": 1,
                   "UAH": 1.64, "USD": 60.66, "UZS": 0.0055}
RUS_HEAD = ['Оклад', 'Название', 'Описание', 'Навыки', 'Опыт работы', 'Премиум-вакансия', 'Компания',
            'Нижний порог оклада', 'Верхний порог оклада', 'С учётом налогов', 'Идентификатор валюты оклада',
            'Название региона', 'Дата публикации вакансии']
RUS_HEAD_FOR_PRINT = ['№', 'Название', 'Описание', 'Навыки', 'Опыт работы', 'Премиум-вакансия', 'Компания', 'Оклад',
                      'Название региона', 'Дата публикации вакансии']
