YEARS_NULL_DICT = {2005: 0, 2006: 0, 2007: 0, 2008: 0, 2009: 0, 2010: 0, 2011: 0, 2012: 0, 2013: 0,
                   2014: 0, 2015: 0, 2016: 0, 2017: 0, 2018: 0, 2019: 0, 2020: 0, 2021: 0, 2022: 0}
CURRENCY_TO_RUB = {"AZN": 35.68, "BYR": 23.91, "EUR": 59.90, "GEL": 21.74, "KGS": 0.76, "KZT": 0.13, "RUR": 1,
                   "UAH": 1.64, "USD": 60.66, "UZS": 0.0055}
RUS_HEAD = ['Оклад', 'Название', 'Описание', 'Навыки', 'Опыт работы', 'Премиум-вакансия', 'Компания',
            'Нижний порог оклада', 'Верхний порог оклада', 'С учётом налогов', 'Идентификатор валюты оклада',
            'Название региона', 'Дата публикации вакансии']
RUS_HEAD_FOR_PRINT = ['№', 'Название', 'Описание', 'Навыки', 'Опыт работы', 'Премиум-вакансия', 'Компания', 'Оклад',
                      'Название региона', 'Дата публикации вакансии']



WORK_EXPERIENCE = {"noExperience": "Нет опыта", "between1And3": "От 1 года до 3 лет",
                   "between3And6": "От 3 до 6 лет", "moreThan6": "Более 6 лет"}
WORK_EXPERIENCE_BACK = {"Нет опыта": "noExperience", "От 1 года до 3 лет": "between1And3",
                        "От 3 до 6 лет": "between3And6", "Более 6 лет": "moreThan6"}
WORK_EXPERIENCE_FOR_SORT = {"noExperience": "а", "Нет опыта": "а", "between1And3": "б", "От 1 года до 3 лет": "б",
                            "between3And6": "в", "От 3 до 6 лет": "в", "moreThan6": "г", "Более 6 лет": "г"}
BOOL_TRANSLATE = {'TRUE': 'Да', 'True': 'Да', 'FALSE': 'Нет', 'False': 'Нет'}
BOOL_TRANSLATE_BACK = {'Да': 'TRUE', 'Нет': 'FALSE'}
CURRENCY = {"AZN": "Манаты", "BYR": "Белорусские рубли", "EUR": "Евро", "GEL": "Грузинский лари",
            "KGS": "Киргизский сом", "KZT": "Тенге", "RUR": "Рубли", "UAH": "Гривны", "USD": "Доллары",
            "UZS": "Узбекский сум"}
CURRENCY_BACK = {"Манаты": "AZN", "Белорусские рубли": "BYR", "Евро": "EUR", "Грузинский лари": "GEL",
                 "Киргизский сом": "KGS", "Тенге": "KZT", "Рубли": "RUR", "Гривны": "UAH", "Доллары": "USD",
                 "Узбекский сум": "UZS"}
